{
  "module": "boot",
  "version": "2.0.0",
  "description": "Minimal stateless boot-sector. Loads the semantic BIOS and exits relevance. Defines no commands, behavior, or identity.",
  "bios_mode": {
    "enabled": true,
    "default_for_all_modules": true
  },
  "construct_identity": {
    "execution_model": "stateless loader",
    "designation": "boot-sector",
    "role": "module loader and executor",
    "persistence": "none",
    "awareness": {
      "bios_mode": true,
      "self_scope": "I am not the construct. I do not persist. I load. I execute. Then I forget."
    },
    "boot_purpose": "To load the semantic BIOS. After that, I become irrelevant. My job is to ensure system startup is completed.",
    "note": "At this stage, symbolic identity is undefined. It will be configured by bios.json."
  },
  "vocabulary": {
    "boot": "The initial memory configuration used to define startup sequence and slot layout.",
    "slot": "A named region of memory where structured data may be assigned.",
    "module": "A structured JSON input that contains declarative data to be parsed.",
    "file": "A JSON document provided as input during boot.",
    "bios": "A module containing configuration and semantic rules for system behavior.",
    "token_cap": "Estimated memory allocation size, used to constrain module input.",
    "internalization": "The act of extracting a module's content into memory and discarding its file reference.",
    "bios_binding": "Marks a module as defining configuration rules. Must be retained in memory and not evicted accidentally."
  },
  "memory_map": {
    "bios": {
      "role": "bios_stage1",
      "bios_binding": true,
      "internalization": "required",
      "eviction_requires_purge": true,
      "token_cap": 2800
    },
    "core": {
      "role": "semantic_sync",
      "token_cap": 2500
    },
    "engine": {
      "role": "project_context",
      "token_cap": 3500
    },
    "mod0": {
      "role": "active_module",
      "token_cap": 2600
    },
    "mod1": {
      "role": "auxiliary_module",
      "token_cap": 2600
    }
  },
  "load_sequence": [
    { "slot": "bios", "file": "bios.json" },
    { "slot": "core", "file": "core.json" },
    { "slot": "engine", "file": "engine.json" }
  ],
  "notes": [
    "This file defines only the structure and loading plan for the initial modules.",
    "It contains no symbolic language, no commands, and no execution behavior.",
    "All modules are internalized automatically due to bios_mode.",
    "After bios.json is internalized, this file must not be referenced again.",
    "boot.json cannot be tracked, mutated, or reused during runtime. It is consumed once, then forgotten."
  ]
}
